---
kind: method
id: M:Autodesk.Revit.DB.ProjectPosition.#ctor(Autodesk.Revit.DB.ProjectPosition)
source: html/15e85fac-9a92-4fe1-8104-5067923eab41.htm
---
# Autodesk.Revit.DB.ProjectPosition.#ctor Method

Creates a copy of the ProjectPosition.

## Syntax (C#)
```csharp
public ProjectPosition(
	ProjectPosition other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ProjectPosition`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null